/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 要使用此中断,请在主程序中调用此函数,在主程序中注册此函数STC的定时器中断函数            */
/*---------------------------------------------------------------------*/

#include	"STC8G_H_Timer.h"
#include	"Task.h"
#include	"APP_INT_UART1.h"
#include	"STC8H_PWM.h"
#include	"STC8G_H_ADC.H"  // 添加ADC头文件 Get_ADCResult(7)
#include	"APP_PWMB.h"     // 添加PWM头文件 Parameter_adjustment();

//========================================================================
// 函数: Timer0_ISR_Handler
// 函数: Timer0中断处理函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void Timer0_ISR_Handler (void) interrupt TIMER0_VECTOR		//已检测到中断
{
  Task_Marks_Handler_Callback();	//调用任务处理回调函数
}

//========================================================================
// 函数: Timer1_ISR_Handler
// 函数: Timer1中断处理函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void Timer1_ISR_Handler (void) interrupt TIMER1_VECTOR		//已检测到中断
{
	// TODO: 在此函数中没有使用到
	P66 = ~P66;
}

//========================================================================
// 函数: Timer2_ISR_Handler
// 函数: Timer2中断处理函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void Timer2_ISR_Handler (void) interrupt TIMER2_VECTOR		//已检测到中断
{
	// TODO: 在此函数中没有使用到
	P65 = ~P65;
}

//========================================================================
// 函数: Timer3_ISR_Handler
// 函数: Timer3中断处理函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void Timer3_ISR_Handler (void) interrupt TIMER3_VECTOR		//已检测到中断
{
	// TODO: 在此函数中没有使用到
	P64 = ~P64;
}

//========================================================================
// 函数: Timer4_ISR_Handler
// 函数: Timer4中断处理函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//注意：
//确保 position的get_position()和Parameter_adjustment() 和 Disp_UP 在此函数中被实现。
//如果不需要使用，请注释掉此函数。
//注意：TIMER4_VECTOR 在STC8G_H_Timer.h中定义，如果需要更改请修改。
//========================================================================
void Timer4_ISR_Handler(void) interrupt TIMER4_VECTOR//替换原定的默认P63 取反
{

		P63 = ~P63;



}
