/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 要使用此程序,请在工程中注释掉使用STC单片机头文件            */
/*---------------------------------------------------------------------*/

#include	"APP.h"
#include "pid_storage.h"

//========================================================================
//                               函数声明	
//========================================================================

u8 code t_display[]={                       //显示码
//   0    1    2    3    4    5    6    7    8    9    A    B    C    D    E    F
    0x3F,0x06,0x5B,0x4F,0x66,0x6D,0x7D,0x07,0x7F,0x6F,0x77,0x7C,0x39,0x5E,0x79,0x71,
//black  -     H    J    K    L    N    o   P    U     t    G    Q    r   M    y
    0x00,0x40,0x76,0x1E,0x70,0x38,0x37,0x5C,0x73,0x3E,0x78,0x3d,0x67,0x50,0x37,0x6e,
    0xBF,0x86,0xDB,0xCF,0xE6,0xED,0xFD,0x87,0xFF,0xEF,0x46};    //0. 1. 2. 3. 4. 5. 6. 7. 8. 9. -1

u8 code T_COM[]={0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80};      //位选

u8 code T_KeyTable[16] = {0,1,2,0,3,0,0,0,4,0,0,0,0,0,0,0};

//========================================================================
//                               全局变量
//========================================================================

u8  LED8[8];        //显示缓存
u8  display_index;  //显示位

u8  IO_KeyState, IO_KeyState1, IO_KeyHoldCnt;    //按键状态
u8  KeyHoldCnt; //按键时间
u8  KeyCode;    //按键编码
u8  cnt50ms;

u8  hour,minute,second; //RTC
u16 msecond;

//========================================================================
// 函数: APP_config
// 功能: 应用初始化.
// 参数: None.
// 返回: None.
// 版本: V1.0, 2020-09-24
//========================================================================
void APP_config(void)
{
//	Lamp_init();
	ADtoUART_init();
	INTtoUART_init();
//	RTC_init();
//	I2C_PS_init();
//	SPI_PS_init();
//	EEPROM_init();
//	WDT_init();
//	PWMA_Output_init();
	PWMB_Output_init();
//	PCA_PWM_init();
//	PCA_Capture_init();
//	PWM15bit_init();
	
	// 加载PID参数
	PID_LoadParams();//从eeprom中加载
}

//========================================================================
// 函数: DisplayScan
// 功能: 显示扫描函数.
// 参数: None.
// 返回: None.
// 版本: V1.0, 2020-09-25
//========================================================================
void DisplayScan(void)
{   
    P7 = ~T_COM[7-display_index];
    P6 = ~t_display[LED8[display_index]];
    if(++display_index >= 8)    display_index = 0;  //8位显示循环到0
}
